app/views/temas/_form.html.erb

SELECT "assuntos".* FROM "assuntos"
---
    <%= f.label :assunto_id %>
    <%= f.collection_select(:assunto_id, Assunto.all, :id, :nome_assunto, prompt: true) %>