app/views/temas/show.html.erb

<h2>Questões</h2>
<% @tema.questaos.each do |questao| %>
---
SELECT  "questaos".* FROM "questaos" WHERE "questaos"."tema_id" = ?  ORDER BY id LIMIT 1 OFFSET 0  [["tema_id", 0]]