app/views/questaos/_form.html.erb


    <%= select_tag :assunto_id, options_from_collection_for_select(Assunto.all, "id", "nome_assunto"), :prompt => "Selecione um Assunto" %>
---
SELECT "assuntos".* FROM "assuntos"

   <%= f.label :tema_id %>
    <%= f.collection_select(:tema_id, Tema.all, :id, :nome_tema, prompt: true) %>
---
SELECT "temas".* FROM "temas"