app/controllers/assuntos_controller.rb

SELECT "assuntos".* FROM "assuntos" WHERE "assuntos"."disponivel" = ?  [["disponivel", 1]]
---
  def index
    # @assuntos = Assunto.all - agora so mostra os assuntos com disponivel = 1
    @assuntos = Assunto.where(:disponivel => '1').all

INSERT INTO "assuntos" ("nome_assunto", "descricao", "user_id", "slug", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["nome_assunto", "asdasdsa"], ["descricao", "asdasdsadas"], ["user_id", 2], ["slug", "asdasdsa"], ["created_at", "2015-06-20 19:41:40.001628"], ["updated_at", "2015-06-20 19:41:40.001628"]]
---
  def create
    @assunto = Assunto.new(assunto_params)
	@assunto.user = current_user
    respond_to do |format|
      if @assunto.save

UPDATE "assuntos" SET "nome_assunto" = ?, "descricao" = ?, "link_image" = ?, "updated_at" = ? WHERE "assuntos"."id" = ?  [["nome_assunto", "Computacao"], ["descricao", "Tudo sobre computacao."], ["link_image", ""], ["updated_at", "2015-05-31 19:00:58.987723"], ["id", 3]]
---
  def update
    respond_to do |format|
      if @assunto.update(assunto_params)

DELETE FROM "assuntos" WHERE "assuntos"."id" = ?  [["id", 1]]
---
  def destroy
    @assunto.destroy

SELECT  "assuntos".* FROM "assuntos" WHERE "assuntos"."id" = ? LIMIT 1  [["id", 2]]
---
    def set_assunto
      @assunto = Assunto.friendly.find(params[:id])