app/controllers/assuntos_controller.rb

SELECT "assuntos".* FROM "assuntos"
---
  def index
    @assuntos = Assunto.all