app/controllers/questaos_controller.rb

  def index
        #@questaos = Questao.all
    @questaos = Questao.where(:disponivel => '1').all
    @questaos = Questao.order("id").where(:tema_id => 12).page(params[:page]).per(1)
---
SELECT "questaos".* FROM "questaos" WHERE "questaos"."disponivel" = ?  [["disponivel", 1]]
SELECT  "questaos".* FROM "questaos" WHERE "questaos"."tema_id" = ?  ORDER BY id LIMIT 1 OFFSET 0  [["tema_id", 1]]
SELECT COUNT(*) FROM "questaos" WHERE "questaos"."tema_id" = ?  [["tema_id", 1]]

  def specializations
    assunto = Assunto.find(params[:assunto_id])
---
SELECT  "assuntos".* FROM "assuntos" WHERE "assuntos"."id" = ? LIMIT 1  [["id", 10]]

  def create
    @questao = Questao.new(questao_params)
    @questao.user = current_user
    @questao.tema_id = (params[:tema_id])
    @questao.assunto_id = (params[:assunto_id])
    respond_to do |format|
      if @questao.save
---
INSERT INTO "questaos" ("pergunta", "resposta", "dica", "user_id", "tema_id", "assunto_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @questao.update(questao_params)
---
UPDATE "questaos" SET "tema_id" = ?, "updated_at" = ? WHERE "questaos"."id" = ?  [["tema_id", 1], ["updated_at", "2015-05-25 19:44:26.455447"], ["id", 2]]

    def set_questao
      @questao = Questao.find(params[:id])
---
SELECT  "questaos".* FROM "questaos" WHERE "questaos"."id" = ? LIMIT 1  [["id", 2]]