app/controllers/questaos_controller.rb

  def index
    @questaos = Questao.all
---
SELECT  "questaos".* FROM "questaos"  ORDER BY id LIMIT 1 OFFSET 0