app/controllers/temas_controller.rb

SELECT "temas".* FROM "temas" WHERE "temas"."disponivel" = ?  [["disponivel", 1]]
---
  def index
    #@temas = Tema.all
    @temas = Tema.where(:disponivel => '1').all

SELECT  "questaos".* FROM "questaos" WHERE "questaos"."tema_id" = ?  ORDER BY id LIMIT 1 OFFSET 0  [["tema_id", 0]]
SELECT COUNT(*) FROM "questaos" WHERE "questaos"."tema_id" = ?  [["tema_id", 0]]
SELECT "questaousers".* FROM "questaousers" WHERE "questaousers"."tema_id" = ? AND "questaousers"."user_id" = 2  [["tema_id", 10]]
INSERT INTO "questaousers" ("user_id", "entendimento", "tema_id", "questao_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 2], ["entendimento", 0], ["tema_id", 10], ["questao_id", 10], ["created_at", "2015-06-21 23:32:56.765101"], ["updated_at", "2015-06-21 23:32:56.765101"]]
---
  def show
    #falta ainda limitar se esta disponivel
    tema = @tema.id
    @questaos = Questao.order("id").where(:tema_id => tema).page(params[:page]).per(1)

   # @questaos = Questaouser.where(:tema_id => tema, :user_id => 2)
    user = current_user
    #@questaouser = Questaouser.find(user.id) parte para nao ficar populando toda hora o banco

    @questaos2 = Questao.where(:tema_id => tema).all.pluck(:id)
    @todos = Questao.where(:tema_id => tema).all.count
    i = 0
    if Questaouser.where(:tema_id => tema, :user_id => user) == []
    while i <  @todos do
      @questaousersalva = Questaouser.new()
      @questaousersalva.user = user
      @questaousersalva.entendimento = 0
      @questaousersalva.tema_id = tema


      @questaousersalva.questao_id = @questaos2[i]
      @questaousersalva.save

INSERT INTO "temas" ("nome_tema", "assunto_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["nome_tema", "arquitetura"], ["assunto_id", 2], ["user_id", 2], ["created_at", "2015-05-25 19:23:28.573416"], ["updated_at", "2015-05-25 19:23:28.573416"]]
---
  def create
    @tema = Tema.new(tema_params)
    @tema.user = current_user
    respond_to do |format|
      if @tema.save

DELETE FROM "temas" WHERE "temas"."id" = ?  [["id", 1]]
---
  def destroy
    @tema.destroy

SELECT  "temas".* FROM "temas" WHERE "temas"."id" = ? LIMIT 1  [["id", 5]]
---
    def set_tema
      @tema = Tema.friendly.find(params[:id])