app/views/assuntos/show.html.erb

<strong>Temas Disponiveis:</strong>
<% @assunto.temas.where(:disponivel => '1').each do |tema| %>
---
SELECT "temas".* FROM "temas" WHERE "temas"."assunto_id" = ? AND "temas"."disponivel" = ?  [["assunto_id", 20], ["disponivel", 1]]