app/views/assuntos/show.html.erb

<h2>Temas</h2>
<% @assunto.temas.each do |tema| %>
---
SELECT "temas".* FROM "temas" WHERE "temas"."assunto_id" = ?  [["assunto_id", 1]]